# --- Задание 1: ДНК ---
def task_1():
    s = input().strip()
    print(s.count('A'), s.count('C'), s.count('G'), s.count('T'))

# --- Задание 2 ---
def task_2():
    # Твой код для 2 задания
    pass

# --- Задание 3 ---
def task_3():
    # Твой код для 3 задания
    pass

# --- Задание 4 ---
def task_4():
    # Твой код для 4 задания
    pass

# --- Задание 5 ---
def task_5():
    # Твой код для 5 задания
    pass

# --- Задание 6 ---
def task_6():
    # Твой код для 6 задания
    pass


# === ЗАПУСК ЗАДАЧ ===
# Оставляй БЕЗ решетки только ту задачу, которую хочешь проверить прямо сейчас

task_1()
# task_2()
# task_3()
# task_4()
# task_5()
# task_6()
